/*=====================================================================
模块名 ：信号机和上位机的通信模块
文件名 ：CATCComWithControlCenterImpl.h
相关文件：OpenATCDataPackUnpack.h  OpenATCSocket.h OpenATCContent.h OpenATCComDef.h
实现功能：信号机和上位机的交互
作者 ：李永萍
版权 ：<Copyright(c) 2019-2020 Suzhou Keda Technology Co.,Ltd. All right reserved.>
--------------------------------------------------------------------------------------------------------------------
修改记录：
日 期           版本    修改人             走读人             修改记录
2019/09/06      V1.0    李永萍）           李永萍             创建模块
====================================================================*/

#ifndef OPENATCCOMWITHCONTROLCENETER_IMPL_H
#define OPENATCCOMWITHCONTROLCENETER_IMPL_H

#include "OpenATCDataPackUnpack.h"
#include "OpenATCSocket.h"
#include "OpenATCCenterCommHandlerBase.h"
#include "../../Include/OpenATCParameter.h"
#include "../../Include/OpenATCRunStatus.h"
#include "../../Include/OpenATCParamStructDefine.h"
#include "../../Include/OpenATCLog.h"
#include "OpenATCComDef.h"
#include "cJSON.h"

/*=====================================================================
类名 ：COpenATCComWithControlCenterImpl
功能 ：信号机和上位机的交互
主要接口：int SendAskOnlineRequest：发送联机请求指令
备注 ：
--------------------------------------------------------------------------------------------------------------------
修改记录：
日 期           版本    修改人             走读人             修改记录
2019/09/06      V1.0    李永萍             李永萍             创建类
====================================================================*/
class COpenATCComWithControlCenterImpl: public COpenATCCenterCommHandlerBase
{

public:
	COpenATCComWithControlCenterImpl(COpenATCParameter *pParameter, COpenATCRunStatus *pRunStatus, COpenATCLog *pOpenATCLog, const char * pOpenATCVersion);
	virtual ~COpenATCComWithControlCenterImpl();

public:

	virtual int ConnectToCenter();

	virtual int DisconnectToCenter();

	virtual int HandleEventFromCenter();

	virtual int SendEventToCenter();

	virtual int TimerJob(bool conStatus);

	/****************************************************
	函数名：ParserPack
    功能：解释收到的协议包
	算法实现:
    参数说明 ： chUnPackedBuff，解包后的数据的缓存
	            dwPackLength，解包后的数据的大小
    返回值说明：OPENATC_RTN_OK，解析数据成功
	            OPENATC_RTN_FAILED，解析数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int ParserPack(const unsigned char *chUnPackedBuff, unsigned int dwPackLength);

	/****************************************************
	函数名：ParserPack_ComLink
    功能：解释收到的通信规程链路协议包
	算法实现:
    参数说明 ： chUnPackedBuff，解包后的数据的缓存
	            dwPackLength，解包后的数据的大小
    返回值说明：OPENATC_RTN_OK，解析数据成功
	            OPENATC_RTN_FAILED，解析数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    int ParserPack_ComLink(const unsigned char *chUnPackedBuff, unsigned int dwPackLength);

    /****************************************************
	函数名：ParserPack_CtrlLink
    功能：解释收到的命令协议包
	算法实现:
    参数说明 ： chUnPackedBuff，解包后的数据的缓存
	            dwPackLength，解包后的数据的大小
    返回值说明：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    int ParserPack_CtrlLink(const unsigned char *chUnPackedBuff, unsigned int dwPackLength);

    /****************************************************
	函数名：ParserPack_CfgLink
    功能：解释收到的参数协议包
	算法实现:
    参数说明 ： chUnPackedBuff，解包后的数据的缓存
	            dwPackLength，解包后的数据的大小
    返回值说明：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    int ParserPack_CfgLink(const unsigned char *chUnPackedBuff, unsigned int dwPackLength);

    /****************************************************
	函数名：ParserPack_BaseInfoLink
    功能：解释收到的基本信息链路协议包
	算法实现:
    参数说明 ： chUnPackedBuff，解包后的数据的缓存
	            dwPackLength，解包后的数据的大小
    返回值说明：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    int ParserPack_BaseInfoLink(const unsigned char *chUnPackedBuff, unsigned int dwPackLength);

    /****************************************************
	函数名：ParserPack_AlternateFeatureParaLink
    功能：解释收到的特征参数一般交互链路协议包
	算法实现:
    参数说明 ： chUnPackedBuff，解包后的数据的缓存
	            dwPackLength，解包后的数据的大小
    返回值说明：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    int ParserPack_AlternateFeatureParaLink(const unsigned char *chUnPackedBuff, unsigned int dwPackLength);

    /****************************************************
	函数名：ParserPack_InterveneCommandLink
    功能：解释收到的干预指令链路协议包
	算法实现:
    参数说明 ： chUnPackedBuff，解包后的数据的缓存
	            dwPackLength，解包后的数据的大小
    返回值说明：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    int ParserPack_InterveneCommandLink(const unsigned char *chUnPackedBuff, unsigned int dwPackLength);

	/****************************************************
	函数名：SendAskOnlineRequest
    功能：信号机发送联机请求指令到上位机
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int SendAskOnlineRequest(void);

	/****************************************************
	函数名：SendAskOnlineQuery
    功能：信号机发送联机查询指令到上位机
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int SendAskOnlineQuery();

	/****************************************************
	函数名：SendTrafficFlow
    功能：信号机主动上传交通流信息
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int SendTrafficFlow();

	/****************************************************
	函数名：SendWorkStatus
    功能：信号机工作状态发生变化后主动上传信息
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int SendWorkStatus();

	/****************************************************
	函数名：SendLampClrStatus
    功能：灯色状态主动上传
	算法实现:
    参数：  byStatus[] 红色状态
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int SendLampClrStatus();

	/****************************************************
	函数名：SendFault
    功能：信号机检测到故障后主动上传消息
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int SendFault();

	/****************************************************
	函数名：SendVersion
    功能：信号机版本主动上传
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int SendVersion();

    /****************************************************
	函数名：AckCtl_AskWorkStatus
    功能：信号机工作状态查询应答
	算法实现:
    参数说明 ： 无
    返回值说明：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    int  AckCtl_AskWorkStatus(void);
 
    /****************************************************
	函数名：AckCtl_AskLampClrStatus
    功能：灯色状态查询应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int  AckCtl_AskLampClrStatus(void);

    /****************************************************
	函数名：AckCtl_AskQueryATCLocalTime
    功能：时间查询应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int  AckCtl_AskQueryATCLocalTime(void);

    /****************************************************
	函数名：AckCtl_AskSetATCLocalTime
    功能：时间设置答
	算法实现:
    参数：  bWrongAck，错误应答
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskSetATCLocalTime(bool bWrongAck);

    /****************************************************
	函数名：AckCtl_AskQueryFault
    功能：信号机故障查询应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int    AckCtl_AskQueryFault(void);
    
    /****************************************************
	函数名：SendAckQueryVersion
    功能：信号机版本查询应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int  AckCtl_AskQueryVersion(void);

    /****************************************************
	函数名：AckCtl_AskQuerySignalLightGroup
    功能：信号灯组查询应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int  AckCtl_AskQuerySignalLightGroup(void);

    /****************************************************
	函数名：AckCtl_AskSetSignalLightGroup
    功能：信号灯组设置应答
	算法实现:
    参数：  bWrongAck，错误应答
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskSetSignalLightGroup(bool bWrongAck);

    /****************************************************
	函数名：AckCtl_AskQueryPhaseParamData
    功能：相位查询应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskQueryPhaseParamData(void);

    /****************************************************
	函数名：AckCtl_AskSetPhaseParamData
    功能：相位查询应答
	算法实现:
    参数：  bWrongAck，错误应答
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskSetPhaseParamData(bool bWrongAck);

    /****************************************************
	函数名：AckCtl_AskQueryPatternParamData
    功能：信号配时方案应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskQueryPatternParamData(void);

    /****************************************************
	函数名：SendAckSetPatternParamData
    功能：信号配时方案设置应答
	算法实现:
    参数：  bWrongAck，错误应答
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskSetPatternParamData(bool bWrongAck);

    /****************************************************
	函数名：AckCtl_AskQueryPlanParamData
    功能：方案调度计划查询应答
	算法实现:
    参数： 无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskQueryPlanParamData();
    
    /****************************************************
	函数名：AckCtl_AskSetPlanParamData
    功能：方案调度计划设置应答
	算法实现:
    参数：  bWrongAck，错误应答
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskSetPlanParamData(bool bWrongAck);

    /****************************************************
	函数名：AckCtl_AskQueryWorkWay
    功能：工作方式查询应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskQueryWorkWay(void);

    /****************************************************
	函数名：AckCtl_AskSetWorkWay
    功能：工作方式设置应答
	算法实现:
    参数：  bWrongAck，错误应答
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskSetWorkWay(bool bWrongAck);

    /****************************************************
	函数名：AckCtl_AskQueryATCParamVersion
    功能：特征参数版本查询应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskQueryATCParamVersion(void);

    /****************************************************
	函数名：AckCtl_AskSetATCParamVersion
    功能：特征参数版本设置应答
	算法实现:
    参数：  bWrongAck，错误应答
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskSetATCParamVersion(bool bWrongAck);

    /****************************************************
	函数名：AckCtl_AskQueryATCCode
    功能：信号机识别码查询应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskQueryATCCode(void);

    /****************************************************
	函数名：AckCtl_AskRemoteControl
    功能：远程控制设置应答
	算法实现:
    参数：  bWrongAck，错误应答
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskRemoteControl(bool bWrongAck);

    /****************************************************
	函数名：AckCtl_AskQueryVecDetectorParamData
    功能：检测器查询应答
	算法实现:
    参数：  无
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int   AckCtl_AskQueryVecDetectorParamData(void);

	/****************************************************
	函数名：AckCtl_AskSetVecDetectorParamData
    功能：检测器设置应答
	算法实现:
    参数：  bWrongAck，错误应答
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int  AckCtl_AskSetVecDetectorParamData(bool bWrongAck);

	/****************************************************
	函数名：OpenATCSleep
    功能：延时
	算法实现:
    参数：  nMsec，毫秒
    返回值：无
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	void  OpenATCSleep(long nMsec);

	/****************************************************
	函数名：SetSysTime
    功能：设置机器时钟
	算法实现:
    参数说明 ： nTime，时间
    返回值说明：true，设置成功
	            false，设置失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    bool  SetSysTime(const long nTime);

	/****************************************************
	函数名：GetGropStatusByRYG
    功能：红灯黄灯绿灯状态合并成CAN通信发送的灯组状态
	算法实现:
    参数说明 ： nBoardIndex，板卡编号，
	            nChannelIndex，通道编号
				chR，chY，chG，红黄绿灯色值
				tCanData，合并后的灯组状态
    返回值说明：无
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    void    GetGropStatusByRYG(int nBoardIndex, int nChannelIndex, char chR, char chY, char chG, TCanData & tCanData);

	/****************************************************
	函数名：GetCanData
    功能：获取灯色数据
	算法实现:
    参数：  chLampClr，灯色数据
            tCanData，转换后的灯色数据
    返回值：发送的数据长度，小于等于零表示发送数据失败
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    void  GetCanData(unsigned char chLampClr[], TCanData tCanData[]);

	/****************************************************
	函数名：SetComPara
    功能：设置和服务端通信类型
	算法实现:
    参数说明 ： 无
    返回值说明：nComType，通信类型
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    void SetComPara(int nComType);

	/****************************************************
	函数名：IsCenterParamChg
    功能：判断通信参数是否被修改
	算法实现:
    参数说明 ： 无
    返回值说明：OPENATC_RTN_OK，参数被修改
	            OPENATC_RTN_FAILED，参数没有被修改
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
    int  IsCenterParamChg();

	/****************************************************
	函数名：SendDetectorChgData
    功能：发送检测器变化量数据
	算法实现:
    参数说明 ：无
    返回值说明：无
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int  SendDetectorChgData();

	/****************************************************
	函数名：SendDetectorStatusData
    功能：发送检测器状态数据
	算法实现:
    参数说明 ：无
    返回值说明：无
    --------------------------------------------------------------------------------------------------------------------
	修改记录：
	日 期           版本    修改人             走读人             修改记录
	2019/09/06      V1.0    李永萍             李永萍             创建
	====================================================================*/
	int  SendDetectorStatusData();

private:
	enum
    {
        RECV_BUFFER_SIZE      = 1024 * 1024,
        UNPACKED_BUFFER_SIZE  = 1024 * 1024, 
		SEND_BUFFER_SIZE      = 1024 * 1024,
        PACKED_BUFFER_SIZE    = 1024 * 1024,

        COMM_ISPARAMCHG_TIME  = 60,

		ASK_ONLINEREQUST_TIME = 30,
    };

	enum
	{
		LOW_LEVEL_DETECTOR    = 0,
		HIGH_LEVEL_DETECTOR   = 1,
		FAULT_LEVELDETECTOR   = 2,
	};

    COpenATCParameter        *m_pOpenATCParameter;

	COpenATCRunStatus        *m_pOpenATCRunStatus;

	COpenATCLog              *m_pOpenATCLog;

	COpenATCDataPackUnpack   m_packerUnPacker;	//存放数据的队列

	COpenATCSocket           m_clientSock;

    TAscArea                 m_tAreaInfo;

    //从socket中接收的数据缓冲区.
    unsigned char            *m_chRecvBuff;

    //解包后协议数据的缓冲区.
    unsigned char            *m_chUnPackedBuff;

    unsigned char            *m_chSendBuff;

    unsigned char            *m_chPackedBuff;

    char                     *m_chOutBuff;

    long				     m_lastSendTime;

    long                     m_lastSendTrafficFlowTime;

	long                     m_lastGetCenterParam;

	TAscCenter               m_tOldAscCenter;

    int                      m_nSendTimeOut;

	int                      m_nRecvTimeOut;

    bool                     m_bConnectStatus;

    bool                     m_bQueryStatus;

    char                     m_chWorkWay;

    char                     m_chParamVersion;

    unsigned char            m_chSignalLightGroupBuffer[1 + MAX_CHANNEL_COUNT * 12];

    unsigned char            m_chPhaseParamBuffer[1 + MAX_PHASE_COUNT * 24];

    unsigned char            m_chPatternParamBuffer[1 + MAX_PATTERN_COUNT * 24];

    unsigned char            m_chPlanParamBuffer[1 + MAX_SCHEDULE_COUNT * 12];

    unsigned char            m_chVecDetectorParamBuffer[1 + MAX_VEHICLEDETECTOR_COUNT * 15];

    bool                     m_bSetSignalLightGroup;

    bool                     m_bSetPhaseParam;

    bool                     m_bSetPatternParam;

    bool                     m_bSetPlanParam;

    bool                     m_bSetWorkWay;

    bool                     m_bSetVedetectorParam;

    int                      m_nLastPhaseStatus[MAX_RING_COUNT * MAX_SEQUENCE_TABLE_COUNT];

	int                      m_nLastCurCtlMode;

	COpenATCPackUnpackBase * m_pDataPackUnpackMode;	

	char					 m_achPastLampClr[C_N_MAXLAMPOUTPUT_NUM];	

	char					 m_achLampClrToSimulate[C_N_MAXLAMPOUTPUT_NUM];	

	int                      m_nComType;

	char					 m_chOpenATCVersion[128];

	cJSON                    *m_msgBody;

	TVehDetBoardData         m_tOldVehDetBoardData;   

	TIOBoardData             m_tOldIOBoardData;   
   
};

#endif //!ifndef OPENATCCOMWITHCONTROLCENETER_IMPL_H
